layers.mmd
graph TD
    subgraph Layer_5["Layer 5"]
        src_analyzers_layers_layers_issue["src/analyzers/layers/layers_issue.dart\n↓3 ↑0"]
        src_config_config_ignore_directives["src/config/config_ignore_directives.dart\n↓7 ↑0"]
        src_analyzers_sorted_sort_analyzer["src/analyzers/sorted/sort_analyzer.dart\n↓1 ↑4"]
        src_analyzers_hardcoded_strings_hardcoded_string_issue["src/analyzers/hardcoded_strings/hardcoded_string_issue.dart\n↓5 ↑0"]
        src_analyzers_magic_numbers_magic_number_issue["src/analyzers/magic_numbers/magic_number_issue.dart\n↓5 ↑0"]
    end
    subgraph Layer_4["Layer 4"]
        src_analyzers_layers_layers_results["src/analyzers/layers/layers_results.dart\n↓7 ↑1"]
        src_graphs_badge_model["src/graphs/badge_model.dart\n↓3 ↑0"]
        src_metrics_file_metrics["src/metrics/file_metrics.dart\n↓2 ↑0"]
        src_analyzer_runner_analysis_file_context["src/analyzer_runner/analysis_file_context.dart\n↓3 ↑1"]
        src_analyzers_layers_layers_visitor["src/analyzers/layers/layers_visitor.dart\n↓2 ↑0"]
        src_analyzers_sorted_sort["src/analyzers/sorted/sort.dart\n↓2 ↑4"]
        src_analyzers_secrets_secret_issue["src/analyzers/secrets/secret_issue.dart\n↓4 ↑0"]
        src_metrics_output["src/metrics/output.dart\n↓2 ↑0"]
        src_analyzer_runner_analyzer_runner_result["src/analyzer_runner/analyzer_runner_result.dart\n↓1 ↑0"]
        src_analyzers_hardcoded_strings_hardcoded_string_visitor["src/analyzers/hardcoded_strings/hardcoded_string_visitor.dart\n↓2 ↑2"]
        src_analyzers_magic_numbers_magic_number_visitor["src/analyzers/magic_numbers/magic_number_visitor.dart\n↓2 ↑2"]
    end
    subgraph Layer_3["Layer 3"]
        src_graphs_graph_format_utils["src/graphs/graph_format_utils.dart\n↓2 ↑1"]
        src_graphs_svg_common["src/graphs/svg_common.dart\n↓2 ↑1"]
        src_graphs_svg_styles["src/graphs/svg_styles.dart\n↓2 ↑0"]
        src_models_rect["src/models/rect.dart\n↓1 ↑0"]
        src_analyzers_layers_layers_analyzer["src/analyzers/layers/layers_analyzer.dart\n↓1 ↑5"]
        src_metrics_project_metrics["src/metrics/project_metrics.dart\n↓1 ↑7"]
        src_analyzer_runner_analyzer_runner["src/analyzer_runner/analyzer_runner.dart\n↓1 ↑3"]
        src_analyzer_runner_analyzer_delegates["src/analyzer_runner/analyzer_delegates.dart\n↓1 ↑10"]
    end
    subgraph Layer_2["Layer 2"]
        src_graphs_export_mermaid["src/graphs/export_mermaid.dart\n↓1 ↑2"]
        src_graphs_export_plantuml["src/graphs/export_plantuml.dart\n↓1 ↑2"]
        src_graphs_export_svg["src/graphs/export_svg.dart\n↓1 ↑4"]
        src_graphs_export_svg_folders["src/graphs/export_svg_folders.dart\n↓1 ↑5"]
        fcheck["fcheck.dart\n↓1 ↑14"]
        src_models_version["src/models/version.dart\n↓1 ↑0"]
    end
    subgraph Layer_6["Layer 6"]
        src_models_file_utils["src/models/file_utils.dart\n↓6 ↑0"]
        src_models_class_visitor["src/models/class_visitor.dart\n↓3 ↑0"]
        src_analyzers_sorted_sort_members["src/analyzers/sorted/sort_members.dart\n↓3 ↑0"]
        src_analyzers_sorted_sort_issue["src/analyzers/sorted/sort_issue.dart\n↓4 ↑0"]
    end
    subgraph Layer_1["Layer 1"]
        ._bin_fcheck["./bin/fcheck.dart\n↓0 ↑7"]
        src_analyzers_hardcoded_strings_hardcoded_string_analyzer["src/analyzers/hardcoded_strings/hardcoded_string_analyzer.dart\n↓0 ↑4"]
        src_analyzers_secrets_secret_analyzer["src/analyzers/secrets/secret_analyzer.dart\n↓0 ↑1"]
        src_analyzers_magic_numbers_magic_number_analyzer["src/analyzers/magic_numbers/magic_number_analyzer.dart\n↓0 ↑4"]
    end
    ._bin_fcheck --> src_graphs_export_mermaid
    ._bin_fcheck --> src_graphs_export_plantuml
    ._bin_fcheck --> src_graphs_export_svg
    ._bin_fcheck --> src_graphs_export_svg_folders
    ._bin_fcheck --> fcheck
    ._bin_fcheck --> src_metrics_output
    ._bin_fcheck --> src_models_version
    fcheck --> src_analyzers_layers_layers_results
    fcheck --> src_metrics_file_metrics
    fcheck --> src_analyzer_runner_analysis_file_context
    fcheck --> src_analyzers_layers_layers_analyzer
    fcheck --> src_analyzers_sorted_sort
    fcheck --> src_metrics_project_metrics
    fcheck --> src_models_file_utils
    fcheck --> src_config_config_ignore_directives
    fcheck --> src_analyzer_runner_analyzer_runner
    fcheck --> src_analyzer_runner_analyzer_delegates
    fcheck --> src_analyzers_hardcoded_strings_hardcoded_string_issue
    fcheck --> src_analyzers_magic_numbers_magic_number_issue
    fcheck --> src_analyzers_sorted_sort_issue
    fcheck --> src_analyzers_secrets_secret_issue
    src_metrics_project_metrics --> src_analyzers_hardcoded_strings_hardcoded_string_issue
    src_metrics_project_metrics --> src_analyzers_layers_layers_issue
    src_metrics_project_metrics --> src_metrics_file_metrics
    src_metrics_project_metrics --> src_analyzers_secrets_secret_issue
    src_metrics_project_metrics --> src_analyzers_magic_numbers_magic_number_issue
    src_metrics_project_metrics --> src_analyzers_sorted_sort
    src_metrics_project_metrics --> src_metrics_output
    src_analyzers_hardcoded_strings_hardcoded_string_visitor --> src_analyzers_hardcoded_strings_hardcoded_string_issue
    src_analyzers_hardcoded_strings_hardcoded_string_visitor --> src_config_config_ignore_directives
    src_analyzers_hardcoded_strings_hardcoded_string_analyzer --> src_models_file_utils
    src_analyzers_hardcoded_strings_hardcoded_string_analyzer --> src_config_config_ignore_directives
    src_analyzers_hardcoded_strings_hardcoded_string_analyzer --> src_analyzers_hardcoded_strings_hardcoded_string_issue
    src_analyzers_hardcoded_strings_hardcoded_string_analyzer --> src_analyzers_hardcoded_strings_hardcoded_string_visitor
    src_analyzers_layers_layers_results --> src_analyzers_layers_layers_issue
    src_analyzers_layers_layers_analyzer --> src_analyzers_layers_layers_results
    src_analyzers_layers_layers_analyzer --> src_models_file_utils
    src_analyzers_layers_layers_analyzer --> src_analyzers_layers_layers_issue
    src_analyzers_layers_layers_analyzer --> src_analyzers_layers_layers_visitor
    src_analyzers_layers_layers_analyzer --> src_config_config_ignore_directives
    src_analyzers_secrets_secret_analyzer --> src_analyzers_secrets_secret_issue
    src_analyzers_sorted_sort --> src_models_class_visitor
    src_analyzers_sorted_sort --> src_analyzers_sorted_sort_members
    src_analyzers_sorted_sort --> src_analyzers_sorted_sort_analyzer
    src_analyzers_sorted_sort --> src_analyzers_sorted_sort_issue
    src_analyzers_sorted_sort_analyzer --> src_models_class_visitor
    src_analyzers_sorted_sort_analyzer --> src_analyzers_sorted_sort_members
    src_analyzers_sorted_sort_analyzer --> src_analyzers_sorted_sort_issue
    src_analyzers_sorted_sort_analyzer --> src_models_file_utils
    src_analyzers_magic_numbers_magic_number_visitor --> src_analyzers_magic_numbers_magic_number_issue
    src_analyzers_magic_numbers_magic_number_visitor --> src_config_config_ignore_directives
    src_analyzers_magic_numbers_magic_number_analyzer --> src_analyzers_magic_numbers_magic_number_issue
    src_analyzers_magic_numbers_magic_number_analyzer --> src_analyzers_magic_numbers_magic_number_visitor
    src_analyzers_magic_numbers_magic_number_analyzer --> src_models_file_utils
    src_analyzers_magic_numbers_magic_number_analyzer --> src_config_config_ignore_directives
    src_analyzer_runner_analysis_file_context --> src_config_config_ignore_directives
    src_analyzer_runner_analyzer_runner --> src_models_file_utils
    src_analyzer_runner_analyzer_runner --> src_analyzer_runner_analyzer_runner_result
    src_analyzer_runner_analyzer_runner --> src_analyzer_runner_analysis_file_context
    src_analyzer_runner_analyzer_delegates --> src_analyzer_runner_analysis_file_context
    src_analyzer_runner_analyzer_delegates --> src_analyzers_hardcoded_strings_hardcoded_string_visitor
    src_analyzer_runner_analyzer_delegates --> src_analyzers_hardcoded_strings_hardcoded_string_issue
    src_analyzer_runner_analyzer_delegates --> src_analyzers_magic_numbers_magic_number_visitor
    src_analyzer_runner_analyzer_delegates --> src_analyzers_magic_numbers_magic_number_issue
    src_analyzer_runner_analyzer_delegates --> src_analyzers_sorted_sort_issue
    src_analyzer_runner_analyzer_delegates --> src_analyzers_sorted_sort_members
    src_analyzer_runner_analyzer_delegates --> src_models_class_visitor
    src_analyzer_runner_analyzer_delegates --> src_analyzers_layers_layers_visitor
    src_analyzer_runner_analyzer_delegates --> src_analyzers_secrets_secret_issue
    src_graphs_graph_format_utils --> src_analyzers_layers_layers_results
    src_graphs_svg_common --> src_graphs_badge_model
    src_graphs_export_plantuml --> src_graphs_graph_format_utils
    src_graphs_export_plantuml --> src_analyzers_layers_layers_results
    src_graphs_export_svg_folders --> src_analyzers_layers_layers_results
    src_graphs_export_svg_folders --> src_models_rect
    src_graphs_export_svg_folders --> src_graphs_svg_common
    src_graphs_export_svg_folders --> src_graphs_svg_styles
    src_graphs_export_svg_folders --> src_graphs_badge_model
    src_graphs_export_svg --> src_analyzers_layers_layers_results
    src_graphs_export_svg --> src_graphs_svg_common
    src_graphs_export_svg --> src_graphs_svg_styles
    src_graphs_export_svg --> src_graphs_badge_model
    src_graphs_export_mermaid --> src_graphs_graph_format_utils
    src_graphs_export_mermaid --> src_analyzers_layers_layers_results
